zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpadc_reg.h
     * |        |          |0010 = Auto-operation Trigger Source from TTMR0.
     * |        |          |0011 = Auto-operation Trigger Source from TTMR1.
     * |        |          |0100 = Auto-operation Trigger Source from WKIOA0.
     * |        |          |0101 = Auto-operation Trigger Source from WKIOB0.
     * |        |          |0110 = Auto-operation Trigger Source from WKIOC0.
     * |        |          |0111 = Auto-operation Trigger Source from WKIOD0.
     * |        |          |1000 = Auto-operation Trigger Source from ACMP0.
     * |        |          |1001 = Auto-operation Trigger Source from ACMP1.
     * |        |          |1010 = Auto-operation Trigger Source from ACMP2.
     * |        |          |1011 = Auto-operation Trigger Source from ACMP3.
     * |        |          |Others = Reserved.
     * |[4]     |TRIGEN    |Automatic Operation Trigger Enable Bit
     * |        |          |When automatic operation mode is enabled, the LPADC will start working if LPADC is triggered by a event sent from the trigger source selected by TRIGSEL[3:0] after this bit is set to 1.
     * |        |          |0 = LPADC Automatic Operation Trigger disabled.
     * |        |          |1 = LPADC Automatic Operation Trigger enabled.
     * |[8]     |ADWKEN    |Automatic Operation Mode Conversion End Wake-up Enable Bit
     * |        |          |0 = LPADC automatic operation conversion end wake-up Disabled.
     * |        |          |1 = LPADC automatic operation conversion end wake-up Enabled.
     * |[9]     |CMP0WKEN  |Automatic Operation Mode Comparator 0 Wake-up Enable Bit
     * |        |          |0 = LPADC automatic operation comparator 0 wake-up Disabled.
     * |        |          |1 = LPADC automatic operation comparator 0 wake-up Enabled.
     * |[10]    |CMP1WKEN  |Automatic Operation Mode Comparator 1 Wake-up Enable Bit
     * |        |          |0 = LPADC automatic operation comparator 1 wake-up Disabled.
     * |        |          |1 = LPADC automatic operation comparator 1 wake-up Enabled.
     * |[31]    |AUTOEN    |Automatic Operation Mode Enable Bit
     * |        |          |0 = LPADC automatic operation Disabled.
     * |        |          |1 = LPADC automatic operation Enabled.
     * @var LPADC_T::AUTOSTRG
     * Offset: 0x804  ADC Auto Operation Software Trigger Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |SWTRIG    |Automatic Operation Software Trigger Bit
     * |        |          |Write 1 to this bit will trigger LPADC start automatic operation
     * |        |          |Note: This bit will be auto cleared by hardware
     * @var LPADC_T::AUTOSTS
     * Offset: 0x810  ADC Auto Operation Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ADWKF     |Automatic Operation Conversion End Wake-up Flag Bit
     * |        |          |When automatic operation mode is enabled, and the conversion is finished, this flag will be set
     * |        |          |If WKEN also set to 1, the chip will be wake-up.
     * |        |          |Software can write one to clear this bit
     * |[1]     |CMP0WKF   |Automatic Operation Compare 0 Wake-up Flag Bit
     * |        |          |When automatic operation mode is enabled, and the conversion result monitor comparator 0 is match setting criteria, this flag will be set
     * |        |          |If CMP0WKEN also set to 1, the chip will be wake-up.
     * |        |          |Software can write one to clear this bit
     * |[2]     |CMP1WKF   |Automatic Operation Compare 1 Wake-up Flag Bit
     * |        |          |When automatic operation mode is enabled, and the conversion result monitor comparator 1 is match setting criteria, this flag will be set
     * |        |          |If CMP1WKEN also set to 1, the chip will be wake-up.
     * |        |          |Software can write one to clear this bit
     */
    __I  uint32_t ADDR[32];              /*!< [0x0000-0x007C] ADC Data Register 0 ~ 31                                  */
    __IO uint32_t ADCR;                  /*!< [0x0080] ADC Control Register                                             */
    __IO uint32_t ADCHER;                /*!< [0x0084] ADC Channel Enable Register                                      */
    __IO uint32_t ADCMPR[2];             /*!< [0x0088-0x008C] ADC Compare Register 0~1                                  */
    __IO uint32_t ADSR0;                 /*!< [0x0090] ADC Status Register0                                             */
    __I  uint32_t ADSR1;                 /*!< [0x0094] ADC Status Register1                                             */
    __I  uint32_t ADSR2;                 /*!< [0x0098] ADC Status Register2                                             */
    __I  uint32_t RESERVE1[1];
    __IO uint32_t ESMPCTL;               /*!< [0x00a0] ADC Extend Sample Time Control Register                          */
    __IO uint32_t CFDCTL;                /*!< [0x00a4] ADC Channel Floating Detect Control Register                     */
    __I  uint32_t RESERVE2[22];
    __I  uint32_t ADPDMA;                /*!< [0x0100] ADC LPPDMA Current Transfer Data Register                        */
    __I  uint32_t RESERVE3[31];
    __IO uint32_t ADCAL;                 /*!< [0x0180] ADC Calibration Mode Register                                    */
    __IO uint32_t ADCALSTS;              /*!< [0x0184] ADC Calibration Status Register                                  */
    __I  uint32_t RESERVE4[414];
    __IO uint32_t AUTOCTL;               /*!< [0x0800] ADC Auto Operation Control Register                              */
    __O  uint32_t AUTOSTRG;              /*!< [0x0804] ADC Auto Operation Software Trigger Register                     */
    __I  uint32_t RESERVE5[2];
    __IO uint32_t AUTOSTS;               /*!< [0x0810] ADC Auto Operation Status Register                               */

} LPADC_T;

/**
    @addtogroup LPADC_CONST LPADC Bit Field Definition
    Constant Definitions for LPADC Controller
@{ */


