zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpadc_reg.h
#define LPADC_ADDR_RSLT_Pos              (0)                                               /*!< LPADC_T::ADDR: RSLT Position           */
#define LPADC_ADDR_RSLT_Msk              (0xfffful << LPADC_ADDR_RSLT_Pos)                 /*!< LPADC_T::ADDR: RSLT Mask               */

#define LPADC_ADDR_OVERRUN_Pos           (16)                                              /*!< LPADC_T::ADDR: OVERRUN Position        */
#define LPADC_ADDR_OVERRUN_Msk           (0x1ul << LPADC_ADDR_OVERRUN_Pos)                 /*!< LPADC_T::ADDR: OVERRUN Mask            */

#define LPADC_ADDR_VALID_Pos             (17)                                              /*!< LPADC_T::ADDR: VALID Position          */
#define LPADC_ADDR_VALID_Msk             (0x1ul << LPADC_ADDR_VALID_Pos)                   /*!< LPADC_T::ADDR: VALID Mask              */

#define LPADC_ADDR0_RSLT_Pos             (0)                                               /*!< LPADC_T::ADDR0: RSLT Position          */
#define LPADC_ADDR0_RSLT_Msk             (0xfffful << LPADC_ADDR0_RSLT_Pos)                /*!< LPADC_T::ADDR0: RSLT Mask              */

#define LPADC_ADDR0_OVERRUN_Pos          (16)                                              /*!< LPADC_T::ADDR0: OVERRUN Position       */
#define LPADC_ADDR0_OVERRUN_Msk          (0x1ul << LPADC_ADDR0_OVERRUN_Pos)                /*!< LPADC_T::ADDR0: OVERRUN Mask           */

#define LPADC_ADDR0_VALID_Pos            (17)                                              /*!< LPADC_T::ADDR0: VALID Position         */
#define LPADC_ADDR0_VALID_Msk            (0x1ul << LPADC_ADDR0_VALID_Pos)                  /*!< LPADC_T::ADDR0: VALID Mask             */

#define LPADC_ADDR1_RSLT_Pos             (0)                                               /*!< LPADC_T::ADDR1: RSLT Position          */
#define LPADC_ADDR1_RSLT_Msk             (0xfffful << LPADC_ADDR1_RSLT_Pos)                /*!< LPADC_T::ADDR1: RSLT Mask              */

#define LPADC_ADDR1_OVERRUN_Pos          (16)                                              /*!< LPADC_T::ADDR1: OVERRUN Position       */
#define LPADC_ADDR1_OVERRUN_Msk          (0x1ul << LPADC_ADDR1_OVERRUN_Pos)                /*!< LPADC_T::ADDR1: OVERRUN Mask           */

#define LPADC_ADDR1_VALID_Pos            (17)                                              /*!< LPADC_T::ADDR1: VALID Position         */
#define LPADC_ADDR1_VALID_Msk            (0x1ul << LPADC_ADDR1_VALID_Pos)                  /*!< LPADC_T::ADDR1: VALID Mask             */

#define LPADC_ADDR2_RSLT_Pos             (0)                                               /*!< LPADC_T::ADDR2: RSLT Position          */
#define LPADC_ADDR2_RSLT_Msk             (0xfffful << LPADC_ADDR2_RSLT_Pos)                /*!< LPADC_T::ADDR2: RSLT Mask              */

#define LPADC_ADDR2_OVERRUN_Pos          (16)                                              /*!< LPADC_T::ADDR2: OVERRUN Position       */
#define LPADC_ADDR2_OVERRUN_Msk          (0x1ul << LPADC_ADDR2_OVERRUN_Pos)                /*!< LPADC_T::ADDR2: OVERRUN Mask           */

#define LPADC_ADDR2_VALID_Pos            (17)                                              /*!< LPADC_T::ADDR2: VALID Position         */
#define LPADC_ADDR2_VALID_Msk            (0x1ul << LPADC_ADDR2_VALID_Pos)                  /*!< LPADC_T::ADDR2: VALID Mask             */

#define LPADC_ADDR3_RSLT_Pos             (0)                                               /*!< LPADC_T::ADDR3: RSLT Position          */
#define LPADC_ADDR3_RSLT_Msk             (0xfffful << LPADC_ADDR3_RSLT_Pos)                /*!< LPADC_T::ADDR3: RSLT Mask              */

#define LPADC_ADDR3_OVERRUN_Pos          (16)                                              /*!< LPADC_T::ADDR3: OVERRUN Position       */
#define LPADC_ADDR3_OVERRUN_Msk          (0x1ul << LPADC_ADDR3_OVERRUN_Pos)                /*!< LPADC_T::ADDR3: OVERRUN Mask           */

#define LPADC_ADDR3_VALID_Pos            (17)                                              /*!< LPADC_T::ADDR3: VALID Position         */
#define LPADC_ADDR3_VALID_Msk            (0x1ul << LPADC_ADDR3_VALID_Pos)                  /*!< LPADC_T::ADDR3: VALID Mask             */

#define LPADC_ADDR4_RSLT_Pos             (0)                                               /*!< LPADC_T::ADDR4: RSLT Position          */
#define LPADC_ADDR4_RSLT_Msk             (0xfffful << LPADC_ADDR4_RSLT_Pos)                /*!< LPADC_T::ADDR4: RSLT Mask              */

#define LPADC_ADDR4_OVERRUN_Pos          (16)                                              /*!< LPADC_T::ADDR4: OVERRUN Position       */
#define LPADC_ADDR4_OVERRUN_Msk          (0x1ul << LPADC_ADDR4_OVERRUN_Pos)                /*!< LPADC_T::ADDR4: OVERRUN Mask           */

#define LPADC_ADDR4_VALID_Pos            (17)                                              /*!< LPADC_T::ADDR4: VALID Position         */
#define LPADC_ADDR4_VALID_Msk            (0x1ul << LPADC_ADDR4_VALID_Pos)                  /*!< LPADC_T::ADDR4: VALID Mask             */

#define LPADC_ADDR5_RSLT_Pos             (0)                                               /*!< LPADC_T::ADDR5: RSLT Position          */
#define LPADC_ADDR5_RSLT_Msk             (0xfffful << LPADC_ADDR5_RSLT_Pos)                /*!< LPADC_T::ADDR5: RSLT Mask              */

#define LPADC_ADDR5_OVERRUN_Pos          (16)                                              /*!< LPADC_T::ADDR5: OVERRUN Position       */
#define LPADC_ADDR5_OVERRUN_Msk          (0x1ul << LPADC_ADDR5_OVERRUN_Pos)                /*!< LPADC_T::ADDR5: OVERRUN Mask           */

#define LPADC_ADDR5_VALID_Pos            (17)                                              /*!< LPADC_T::ADDR5: VALID Position         */
#define LPADC_ADDR5_VALID_Msk            (0x1ul << LPADC_ADDR5_VALID_Pos)                  /*!< LPADC_T::ADDR5: VALID Mask             */

#define LPADC_ADDR6_RSLT_Pos             (0)                                               /*!< LPADC_T::ADDR6: RSLT Position          */
#define LPADC_ADDR6_RSLT_Msk             (0xfffful << LPADC_ADDR6_RSLT_Pos)                /*!< LPADC_T::ADDR6: RSLT Mask              */

#define LPADC_ADDR6_OVERRUN_Pos          (16)                                              /*!< LPADC_T::ADDR6: OVERRUN Position       */
#define LPADC_ADDR6_OVERRUN_Msk          (0x1ul << LPADC_ADDR6_OVERRUN_Pos)                /*!< LPADC_T::ADDR6: OVERRUN Mask           */

#define LPADC_ADDR6_VALID_Pos            (17)                                              /*!< LPADC_T::ADDR6: VALID Position         */
#define LPADC_ADDR6_VALID_Msk            (0x1ul << LPADC_ADDR6_VALID_Pos)                  /*!< LPADC_T::ADDR6: VALID Mask             */

#define LPADC_ADDR7_RSLT_Pos             (0)                                               /*!< LPADC_T::ADDR7: RSLT Position          */
#define LPADC_ADDR7_RSLT_Msk             (0xfffful << LPADC_ADDR7_RSLT_Pos)                /*!< LPADC_T::ADDR7: RSLT Mask              */

#define LPADC_ADDR7_OVERRUN_Pos          (16)                                              /*!< LPADC_T::ADDR7: OVERRUN Position       */
#define LPADC_ADDR7_OVERRUN_Msk          (0x1ul << LPADC_ADDR7_OVERRUN_Pos)                /*!< LPADC_T::ADDR7: OVERRUN Mask           */

#define LPADC_ADDR7_VALID_Pos            (17)                                              /*!< LPADC_T::ADDR7: VALID Position         */
#define LPADC_ADDR7_VALID_Msk            (0x1ul << LPADC_ADDR7_VALID_Pos)                  /*!< LPADC_T::ADDR7: VALID Mask             */

#define LPADC_ADDR8_RSLT_Pos             (0)                                               /*!< LPADC_T::ADDR8: RSLT Position          */
#define LPADC_ADDR8_RSLT_Msk             (0xfffful << LPADC_ADDR8_RSLT_Pos)                /*!< LPADC_T::ADDR8: RSLT Mask              */

#define LPADC_ADDR8_OVERRUN_Pos          (16)                                              /*!< LPADC_T::ADDR8: OVERRUN Position       */
#define LPADC_ADDR8_OVERRUN_Msk          (0x1ul << LPADC_ADDR8_OVERRUN_Pos)                /*!< LPADC_T::ADDR8: OVERRUN Mask           */

