zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpadc_reg.h
#define LPADC_ADDR8_VALID_Pos            (17)                                              /*!< LPADC_T::ADDR8: VALID Position         */
#define LPADC_ADDR8_VALID_Msk            (0x1ul << LPADC_ADDR8_VALID_Pos)                  /*!< LPADC_T::ADDR8: VALID Mask             */

#define LPADC_ADDR9_RSLT_Pos             (0)                                               /*!< LPADC_T::ADDR9: RSLT Position          */
#define LPADC_ADDR9_RSLT_Msk             (0xfffful << LPADC_ADDR9_RSLT_Pos)                /*!< LPADC_T::ADDR9: RSLT Mask              */

#define LPADC_ADDR9_OVERRUN_Pos          (16)                                              /*!< LPADC_T::ADDR9: OVERRUN Position       */
#define LPADC_ADDR9_OVERRUN_Msk          (0x1ul << LPADC_ADDR9_OVERRUN_Pos)                /*!< LPADC_T::ADDR9: OVERRUN Mask           */

#define LPADC_ADDR9_VALID_Pos            (17)                                              /*!< LPADC_T::ADDR9: VALID Position         */
#define LPADC_ADDR9_VALID_Msk            (0x1ul << LPADC_ADDR9_VALID_Pos)                  /*!< LPADC_T::ADDR9: VALID Mask             */

#define LPADC_ADDR10_RSLT_Pos            (0)                                               /*!< LPADC_T::ADDR10: RSLT Position         */
#define LPADC_ADDR10_RSLT_Msk            (0xfffful << LPADC_ADDR10_RSLT_Pos)               /*!< LPADC_T::ADDR10: RSLT Mask             */

#define LPADC_ADDR10_OVERRUN_Pos         (16)                                              /*!< LPADC_T::ADDR10: OVERRUN Position      */
#define LPADC_ADDR10_OVERRUN_Msk         (0x1ul << LPADC_ADDR10_OVERRUN_Pos)               /*!< LPADC_T::ADDR10: OVERRUN Mask          */

#define LPADC_ADDR10_VALID_Pos           (17)                                              /*!< LPADC_T::ADDR10: VALID Position        */
#define LPADC_ADDR10_VALID_Msk           (0x1ul << LPADC_ADDR10_VALID_Pos)                 /*!< LPADC_T::ADDR10: VALID Mask            */

#define LPADC_ADDR11_RSLT_Pos            (0)                                               /*!< LPADC_T::ADDR11: RSLT Position         */
#define LPADC_ADDR11_RSLT_Msk            (0xfffful << LPADC_ADDR11_RSLT_Pos)               /*!< LPADC_T::ADDR11: RSLT Mask             */

#define LPADC_ADDR11_OVERRUN_Pos         (16)                                              /*!< LPADC_T::ADDR11: OVERRUN Position      */
#define LPADC_ADDR11_OVERRUN_Msk         (0x1ul << LPADC_ADDR11_OVERRUN_Pos)               /*!< LPADC_T::ADDR11: OVERRUN Mask          */

#define LPADC_ADDR11_VALID_Pos           (17)                                              /*!< LPADC_T::ADDR11: VALID Position        */
#define LPADC_ADDR11_VALID_Msk           (0x1ul << LPADC_ADDR11_VALID_Pos)                 /*!< LPADC_T::ADDR11: VALID Mask            */

#define LPADC_ADDR12_RSLT_Pos            (0)                                               /*!< LPADC_T::ADDR12: RSLT Position         */
#define LPADC_ADDR12_RSLT_Msk            (0xfffful << LPADC_ADDR12_RSLT_Pos)               /*!< LPADC_T::ADDR12: RSLT Mask             */

#define LPADC_ADDR12_OVERRUN_Pos         (16)                                              /*!< LPADC_T::ADDR12: OVERRUN Position      */
#define LPADC_ADDR12_OVERRUN_Msk         (0x1ul << LPADC_ADDR12_OVERRUN_Pos)               /*!< LPADC_T::ADDR12: OVERRUN Mask          */

#define LPADC_ADDR12_VALID_Pos           (17)                                              /*!< LPADC_T::ADDR12: VALID Position        */
#define LPADC_ADDR12_VALID_Msk           (0x1ul << LPADC_ADDR12_VALID_Pos)                 /*!< LPADC_T::ADDR12: VALID Mask            */

#define LPADC_ADDR13_RSLT_Pos            (0)                                               /*!< LPADC_T::ADDR13: RSLT Position         */
#define LPADC_ADDR13_RSLT_Msk            (0xfffful << LPADC_ADDR13_RSLT_Pos)               /*!< LPADC_T::ADDR13: RSLT Mask             */

#define LPADC_ADDR13_OVERRUN_Pos         (16)                                              /*!< LPADC_T::ADDR13: OVERRUN Position      */
#define LPADC_ADDR13_OVERRUN_Msk         (0x1ul << LPADC_ADDR13_OVERRUN_Pos)               /*!< LPADC_T::ADDR13: OVERRUN Mask          */

#define LPADC_ADDR13_VALID_Pos           (17)                                              /*!< LPADC_T::ADDR13: VALID Position        */
#define LPADC_ADDR13_VALID_Msk           (0x1ul << LPADC_ADDR13_VALID_Pos)                 /*!< LPADC_T::ADDR13: VALID Mask            */

#define LPADC_ADDR14_RSLT_Pos            (0)                                               /*!< LPADC_T::ADDR14: RSLT Position         */
#define LPADC_ADDR14_RSLT_Msk            (0xfffful << LPADC_ADDR14_RSLT_Pos)               /*!< LPADC_T::ADDR14: RSLT Mask             */

#define LPADC_ADDR14_OVERRUN_Pos         (16)                                              /*!< LPADC_T::ADDR14: OVERRUN Position      */
#define LPADC_ADDR14_OVERRUN_Msk         (0x1ul << LPADC_ADDR14_OVERRUN_Pos)               /*!< LPADC_T::ADDR14: OVERRUN Mask          */

#define LPADC_ADDR14_VALID_Pos           (17)                                              /*!< LPADC_T::ADDR14: VALID Position        */
#define LPADC_ADDR14_VALID_Msk           (0x1ul << LPADC_ADDR14_VALID_Pos)                 /*!< LPADC_T::ADDR14: VALID Mask            */

#define LPADC_ADDR15_RSLT_Pos            (0)                                               /*!< LPADC_T::ADDR15: RSLT Position         */
#define LPADC_ADDR15_RSLT_Msk            (0xfffful << LPADC_ADDR15_RSLT_Pos)               /*!< LPADC_T::ADDR15: RSLT Mask             */

#define LPADC_ADDR15_OVERRUN_Pos         (16)                                              /*!< LPADC_T::ADDR15: OVERRUN Position      */
#define LPADC_ADDR15_OVERRUN_Msk         (0x1ul << LPADC_ADDR15_OVERRUN_Pos)               /*!< LPADC_T::ADDR15: OVERRUN Mask          */

#define LPADC_ADDR15_VALID_Pos           (17)                                              /*!< LPADC_T::ADDR15: VALID Position        */
#define LPADC_ADDR15_VALID_Msk           (0x1ul << LPADC_ADDR15_VALID_Pos)                 /*!< LPADC_T::ADDR15: VALID Mask            */

#define LPADC_ADDR16_RSLT_Pos            (0)                                               /*!< LPADC_T::ADDR16: RSLT Position         */
#define LPADC_ADDR16_RSLT_Msk            (0xfffful << LPADC_ADDR16_RSLT_Pos)               /*!< LPADC_T::ADDR16: RSLT Mask             */

#define LPADC_ADDR16_OVERRUN_Pos         (16)                                              /*!< LPADC_T::ADDR16: OVERRUN Position      */
#define LPADC_ADDR16_OVERRUN_Msk         (0x1ul << LPADC_ADDR16_OVERRUN_Pos)               /*!< LPADC_T::ADDR16: OVERRUN Mask          */

#define LPADC_ADDR16_VALID_Pos           (17)                                              /*!< LPADC_T::ADDR16: VALID Position        */
#define LPADC_ADDR16_VALID_Msk           (0x1ul << LPADC_ADDR16_VALID_Pos)                 /*!< LPADC_T::ADDR16: VALID Mask            */

#define LPADC_ADDR17_RSLT_Pos            (0)                                               /*!< LPADC_T::ADDR17: RSLT Position         */
#define LPADC_ADDR17_RSLT_Msk            (0xfffful << LPADC_ADDR17_RSLT_Pos)               /*!< LPADC_T::ADDR17: RSLT Mask             */

#define LPADC_ADDR17_OVERRUN_Pos         (16)                                              /*!< LPADC_T::ADDR17: OVERRUN Position      */
#define LPADC_ADDR17_OVERRUN_Msk         (0x1ul << LPADC_ADDR17_OVERRUN_Pos)               /*!< LPADC_T::ADDR17: OVERRUN Mask          */

#define LPADC_ADDR17_VALID_Pos           (17)                                              /*!< LPADC_T::ADDR17: VALID Position        */
#define LPADC_ADDR17_VALID_Msk           (0x1ul << LPADC_ADDR17_VALID_Pos)                 /*!< LPADC_T::ADDR17: VALID Mask            */

#define LPADC_ADDR18_RSLT_Pos            (0)                                               /*!< LPADC_T::ADDR18: RSLT Position         */
#define LPADC_ADDR18_RSLT_Msk            (0xfffful << LPADC_ADDR18_RSLT_Pos)               /*!< LPADC_T::ADDR18: RSLT Mask             */

#define LPADC_ADDR18_OVERRUN_Pos         (16)                                              /*!< LPADC_T::ADDR18: OVERRUN Position      */
#define LPADC_ADDR18_OVERRUN_Msk         (0x1ul << LPADC_ADDR18_OVERRUN_Pos)               /*!< LPADC_T::ADDR18: OVERRUN Mask          */

