zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpadc_reg.h
#define LPADC_ADDR18_VALID_Pos           (17)                                              /*!< LPADC_T::ADDR18: VALID Position        */
#define LPADC_ADDR18_VALID_Msk           (0x1ul << LPADC_ADDR18_VALID_Pos)                 /*!< LPADC_T::ADDR18: VALID Mask            */

#define LPADC_ADDR19_RSLT_Pos            (0)                                               /*!< LPADC_T::ADDR19: RSLT Position         */
#define LPADC_ADDR19_RSLT_Msk            (0xfffful << LPADC_ADDR19_RSLT_Pos)               /*!< LPADC_T::ADDR19: RSLT Mask             */

#define LPADC_ADDR19_OVERRUN_Pos         (16)                                              /*!< LPADC_T::ADDR19: OVERRUN Position      */
#define LPADC_ADDR19_OVERRUN_Msk         (0x1ul << LPADC_ADDR19_OVERRUN_Pos)               /*!< LPADC_T::ADDR19: OVERRUN Mask          */

#define LPADC_ADDR19_VALID_Pos           (17)                                              /*!< LPADC_T::ADDR19: VALID Position        */
#define LPADC_ADDR19_VALID_Msk           (0x1ul << LPADC_ADDR19_VALID_Pos)                 /*!< LPADC_T::ADDR19: VALID Mask            */

#define LPADC_ADDR20_RSLT_Pos            (0)                                               /*!< LPADC_T::ADDR20: RSLT Position         */
#define LPADC_ADDR20_RSLT_Msk            (0xfffful << LPADC_ADDR20_RSLT_Pos)               /*!< LPADC_T::ADDR20: RSLT Mask             */

#define LPADC_ADDR20_OVERRUN_Pos         (16)                                              /*!< LPADC_T::ADDR20: OVERRUN Position      */
#define LPADC_ADDR20_OVERRUN_Msk         (0x1ul << LPADC_ADDR20_OVERRUN_Pos)               /*!< LPADC_T::ADDR20: OVERRUN Mask          */

#define LPADC_ADDR20_VALID_Pos           (17)                                              /*!< LPADC_T::ADDR20: VALID Position        */
#define LPADC_ADDR20_VALID_Msk           (0x1ul << LPADC_ADDR20_VALID_Pos)                 /*!< LPADC_T::ADDR20: VALID Mask            */

#define LPADC_ADDR21_RSLT_Pos            (0)                                               /*!< LPADC_T::ADDR21: RSLT Position         */
#define LPADC_ADDR21_RSLT_Msk            (0xfffful << LPADC_ADDR21_RSLT_Pos)               /*!< LPADC_T::ADDR21: RSLT Mask             */

#define LPADC_ADDR21_OVERRUN_Pos         (16)                                              /*!< LPADC_T::ADDR21: OVERRUN Position      */
#define LPADC_ADDR21_OVERRUN_Msk         (0x1ul << LPADC_ADDR21_OVERRUN_Pos)               /*!< LPADC_T::ADDR21: OVERRUN Mask          */

#define LPADC_ADDR21_VALID_Pos           (17)                                              /*!< LPADC_T::ADDR21: VALID Position        */
#define LPADC_ADDR21_VALID_Msk           (0x1ul << LPADC_ADDR21_VALID_Pos)                 /*!< LPADC_T::ADDR21: VALID Mask            */

#define LPADC_ADDR22_RSLT_Pos            (0)                                               /*!< LPADC_T::ADDR22: RSLT Position         */
#define LPADC_ADDR22_RSLT_Msk            (0xfffful << LPADC_ADDR22_RSLT_Pos)               /*!< LPADC_T::ADDR22: RSLT Mask             */

#define LPADC_ADDR22_OVERRUN_Pos         (16)                                              /*!< LPADC_T::ADDR22: OVERRUN Position      */
#define LPADC_ADDR22_OVERRUN_Msk         (0x1ul << LPADC_ADDR22_OVERRUN_Pos)               /*!< LPADC_T::ADDR22: OVERRUN Mask          */

#define LPADC_ADDR22_VALID_Pos           (17)                                              /*!< LPADC_T::ADDR22: VALID Position        */
#define LPADC_ADDR22_VALID_Msk           (0x1ul << LPADC_ADDR22_VALID_Pos)                 /*!< LPADC_T::ADDR22: VALID Mask            */

#define LPADC_ADDR23_RSLT_Pos            (0)                                               /*!< LPADC_T::ADDR23: RSLT Position         */
#define LPADC_ADDR23_RSLT_Msk            (0xfffful << LPADC_ADDR23_RSLT_Pos)               /*!< LPADC_T::ADDR23: RSLT Mask             */

#define LPADC_ADDR23_OVERRUN_Pos         (16)                                              /*!< LPADC_T::ADDR23: OVERRUN Position      */
#define LPADC_ADDR23_OVERRUN_Msk         (0x1ul << LPADC_ADDR23_OVERRUN_Pos)               /*!< LPADC_T::ADDR23: OVERRUN Mask          */

#define LPADC_ADDR23_VALID_Pos           (17)                                              /*!< LPADC_T::ADDR23: VALID Position        */
#define LPADC_ADDR23_VALID_Msk           (0x1ul << LPADC_ADDR23_VALID_Pos)                 /*!< LPADC_T::ADDR23: VALID Mask            */

#define LPADC_ADDR28_RSLT_Pos            (0)                                               /*!< LPADC_T::ADDR28: RSLT Position         */
#define LPADC_ADDR28_RSLT_Msk            (0xfffful << LPADC_ADDR28_RSLT_Pos)               /*!< LPADC_T::ADDR28: RSLT Mask             */

#define LPADC_ADDR28_OVERRUN_Pos         (16)                                              /*!< LPADC_T::ADDR28: OVERRUN Position      */
#define LPADC_ADDR28_OVERRUN_Msk         (0x1ul << LPADC_ADDR28_OVERRUN_Pos)               /*!< LPADC_T::ADDR28: OVERRUN Mask          */

#define LPADC_ADDR28_VALID_Pos           (17)                                              /*!< LPADC_T::ADDR28: VALID Position        */
#define LPADC_ADDR28_VALID_Msk           (0x1ul << LPADC_ADDR28_VALID_Pos)                 /*!< LPADC_T::ADDR28: VALID Mask            */

#define LPADC_ADDR29_RSLT_Pos            (0)                                               /*!< LPADC_T::ADDR29: RSLT Position         */
#define LPADC_ADDR29_RSLT_Msk            (0xfffful << LPADC_ADDR29_RSLT_Pos)               /*!< LPADC_T::ADDR29: RSLT Mask             */

#define LPADC_ADDR29_OVERRUN_Pos         (16)                                              /*!< LPADC_T::ADDR29: OVERRUN Position      */
#define LPADC_ADDR29_OVERRUN_Msk         (0x1ul << LPADC_ADDR29_OVERRUN_Pos)               /*!< LPADC_T::ADDR29: OVERRUN Mask          */

#define LPADC_ADDR29_VALID_Pos           (17)                                              /*!< LPADC_T::ADDR29: VALID Position        */
#define LPADC_ADDR29_VALID_Msk           (0x1ul << LPADC_ADDR29_VALID_Pos)                 /*!< LPADC_T::ADDR29: VALID Mask            */

#define LPADC_ADDR30_RSLT_Pos            (0)                                               /*!< LPADC_T::ADDR30: RSLT Position         */
#define LPADC_ADDR30_RSLT_Msk            (0xfffful << LPADC_ADDR30_RSLT_Pos)               /*!< LPADC_T::ADDR30: RSLT Mask             */

