zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpadc_reg.h
#define LPADC_ADDR30_OVERRUN_Pos         (16)                                              /*!< LPADC_T::ADDR30: OVERRUN Position      */
#define LPADC_ADDR30_OVERRUN_Msk         (0x1ul << LPADC_ADDR30_OVERRUN_Pos)               /*!< LPADC_T::ADDR30: OVERRUN Mask          */

#define LPADC_ADDR30_VALID_Pos           (17)                                              /*!< LPADC_T::ADDR30: VALID Position        */
#define LPADC_ADDR30_VALID_Msk           (0x1ul << LPADC_ADDR30_VALID_Pos)                 /*!< LPADC_T::ADDR30: VALID Mask            */

#define LPADC_ADDR31_RSLT_Pos            (0)                                               /*!< LPADC_T::ADDR31: RSLT Position         */
#define LPADC_ADDR31_RSLT_Msk            (0xfffful << LPADC_ADDR31_RSLT_Pos)               /*!< LPADC_T::ADDR31: RSLT Mask             */

#define LPADC_ADDR31_OVERRUN_Pos         (16)                                              /*!< LPADC_T::ADDR31: OVERRUN Position      */
#define LPADC_ADDR31_OVERRUN_Msk         (0x1ul << LPADC_ADDR31_OVERRUN_Pos)               /*!< LPADC_T::ADDR31: OVERRUN Mask          */

#define LPADC_ADDR31_VALID_Pos           (17)                                              /*!< LPADC_T::ADDR31: VALID Position        */
#define LPADC_ADDR31_VALID_Msk           (0x1ul << LPADC_ADDR31_VALID_Pos)                 /*!< LPADC_T::ADDR31: VALID Mask            */

#define LPADC_ADCR_ADEN_Pos              (0)                                               /*!< LPADC_T::ADCR: ADEN Position           */
#define LPADC_ADCR_ADEN_Msk              (0x1ul << LPADC_ADCR_ADEN_Pos)                    /*!< LPADC_T::ADCR: ADEN Mask               */

#define LPADC_ADCR_ADIE_Pos              (1)                                               /*!< LPADC_T::ADCR: ADIE Position           */
#define LPADC_ADCR_ADIE_Msk              (0x1ul << LPADC_ADCR_ADIE_Pos)                    /*!< LPADC_T::ADCR: ADIE Mask               */

#define LPADC_ADCR_ADMD_Pos              (2)                                               /*!< LPADC_T::ADCR: ADMD Position           */
#define LPADC_ADCR_ADMD_Msk              (0x3ul << LPADC_ADCR_ADMD_Pos)                    /*!< LPADC_T::ADCR: ADMD Mask               */

#define LPADC_ADCR_TRGCOND_Pos           (6)                                               /*!< LPADC_T::ADCR: TRGCOND Position        */
#define LPADC_ADCR_TRGCOND_Msk           (0x3ul << LPADC_ADCR_TRGCOND_Pos)                 /*!< LPADC_T::ADCR: TRGCOND Mask            */

#define LPADC_ADCR_TRGEN_Pos             (8)                                               /*!< LPADC_T::ADCR: TRGEN Position          */
#define LPADC_ADCR_TRGEN_Msk             (0x1ul << LPADC_ADCR_TRGEN_Pos)                   /*!< LPADC_T::ADCR: TRGEN Mask              */

#define LPADC_ADCR_PTEN_Pos              (9)                                               /*!< LPADC_T::ADCR: PTEN Position           */
#define LPADC_ADCR_PTEN_Msk              (0x1ul << LPADC_ADCR_PTEN_Pos)                    /*!< LPADC_T::ADCR: PTEN Mask               */

#define LPADC_ADCR_DIFFEN_Pos            (10)                                              /*!< LPADC_T::ADCR: DIFFEN Position         */
#define LPADC_ADCR_DIFFEN_Msk            (0x1ul << LPADC_ADCR_DIFFEN_Pos)                  /*!< LPADC_T::ADCR: DIFFEN Mask             */

#define LPADC_ADCR_ADST_Pos              (11)                                              /*!< LPADC_T::ADCR: ADST Position           */
#define LPADC_ADCR_ADST_Msk              (0x1ul << LPADC_ADCR_ADST_Pos)                    /*!< LPADC_T::ADCR: ADST Mask               */

#define LPADC_ADCR_RESET_Pos             (12)                                              /*!< LPADC_T::ADCR: RESET Position          */
#define LPADC_ADCR_RESET_Msk             (0x1ul << LPADC_ADCR_RESET_Pos)                   /*!< LPADC_T::ADCR: RESET Mask              */

#define LPADC_ADCR_TRGS_Pos              (16)                                              /*!< LPADC_T::ADCR: TRGS Position           */
#define LPADC_ADCR_TRGS_Msk              (0xful << LPADC_ADCR_TRGS_Pos)                    /*!< LPADC_T::ADCR: TRGS Mask               */

#define LPADC_ADCR_RESSEL_Pos            (28)                                              /*!< LPADC_T::ADCR: RESSEL Position         */
#define LPADC_ADCR_RESSEL_Msk            (0x3ul << LPADC_ADCR_RESSEL_Pos)                  /*!< LPADC_T::ADCR: RESSEL Mask             */

#define LPADC_ADCR_DMOF_Pos              (31)                                              /*!< LPADC_T::ADCR: DMOF Position           */
#define LPADC_ADCR_DMOF_Msk              (0x1ul << LPADC_ADCR_DMOF_Pos)                    /*!< LPADC_T::ADCR: DMOF Mask               */

#define LPADC_ADCHER_CHEN_Pos            (0)                                               /*!< LPADC_T::ADCHER: CHEN Position         */
#define LPADC_ADCHER_CHEN_Msk            (0xfffffffful << LPADC_ADCHER_CHEN_Pos)           /*!< LPADC_T::ADCHER: CHEN Mask             */

#define LPADC_ADCMPR_CMPEN_Pos           (0)                                               /*!< LPADC_T::ADCMPR: CMPEN Position        */
#define LPADC_ADCMPR_CMPEN_Msk           (0x1ul << LPADC_ADCMPR_CMPEN_Pos)                 /*!< LPADC_T::ADCMPR: CMPEN Mask            */

#define LPADC_ADCMPR_CMPIE_Pos           (1)                                               /*!< LPADC_T::ADCMPR: CMPIE Position        */
#define LPADC_ADCMPR_CMPIE_Msk           (0x1ul << LPADC_ADCMPR_CMPIE_Pos)                 /*!< LPADC_T::ADCMPR: CMPIE Mask            */

#define LPADC_ADCMPR_CMPCOND_Pos         (2)                                               /*!< LPADC_T::ADCMPR: CMPCOND Position      */
#define LPADC_ADCMPR_CMPCOND_Msk         (0x1ul << LPADC_ADCMPR_CMPCOND_Pos)               /*!< LPADC_T::ADCMPR: CMPCOND Mask          */

#define LPADC_ADCMPR_CMPCH_Pos           (3)                                               /*!< LPADC_T::ADCMPR: CMPCH Position        */
#define LPADC_ADCMPR_CMPCH_Msk           (0x1ful << LPADC_ADCMPR_CMPCH_Pos)                /*!< LPADC_T::ADCMPR: CMPCH Mask            */

#define LPADC_ADCMPR_CMPMATCNT_Pos       (8)                                               /*!< LPADC_T::ADCMPR: CMPMATCNT Position    */
#define LPADC_ADCMPR_CMPMATCNT_Msk       (0xful << LPADC_ADCMPR_CMPMATCNT_Pos)             /*!< LPADC_T::ADCMPR: CMPMATCNT Mask        */

#define LPADC_ADCMPR_CMPWEN_Pos          (15)                                              /*!< LPADC_T::ADCMPR: CMPWEN Position       */
#define LPADC_ADCMPR_CMPWEN_Msk          (0x1ul << LPADC_ADCMPR_CMPWEN_Pos)                /*!< LPADC_T::ADCMPR: CMPWEN Mask           */

#define LPADC_ADCMPR_CMPD_Pos            (16)                                              /*!< LPADC_T::ADCMPR: CMPD Position         */
#define LPADC_ADCMPR_CMPD_Msk            (0xffful << LPADC_ADCMPR_CMPD_Pos)                /*!< LPADC_T::ADCMPR: CMPD Mask             */

