zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpadc_reg.h
#define LPADC_ADCMPR0_CMPEN_Pos          (0)                                               /*!< LPADC_T::ADCMPR0: CMPEN Position       */
#define LPADC_ADCMPR0_CMPEN_Msk          (0x1ul << LPADC_ADCMPR0_CMPEN_Pos)                /*!< LPADC_T::ADCMPR0: CMPEN Mask           */

#define LPADC_ADCMPR0_CMPIE_Pos          (1)                                               /*!< LPADC_T::ADCMPR0: CMPIE Position       */
#define LPADC_ADCMPR0_CMPIE_Msk          (0x1ul << LPADC_ADCMPR0_CMPIE_Pos)                /*!< LPADC_T::ADCMPR0: CMPIE Mask           */

#define LPADC_ADCMPR0_CMPCOND_Pos        (2)                                               /*!< LPADC_T::ADCMPR0: CMPCOND Position     */
#define LPADC_ADCMPR0_CMPCOND_Msk        (0x1ul << LPADC_ADCMPR0_CMPCOND_Pos)              /*!< LPADC_T::ADCMPR0: CMPCOND Mask         */

#define LPADC_ADCMPR0_CMPCH_Pos          (3)                                               /*!< LPADC_T::ADCMPR0: CMPCH Position       */
#define LPADC_ADCMPR0_CMPCH_Msk          (0x1ful << LPADC_ADCMPR0_CMPCH_Pos)               /*!< LPADC_T::ADCMPR0: CMPCH Mask           */

#define LPADC_ADCMPR0_CMPMCNT_Pos        (8)                                               /*!< LPADC_T::ADCMPR0: CMPMCNT Position     */
#define LPADC_ADCMPR0_CMPMCNT_Msk        (0xful << LPADC_ADCMPR0_CMPMCNT_Pos)              /*!< LPADC_T::ADCMPR0: CMPMCNT Mask         */

#define LPADC_ADCMPR0_CMPWEN_Pos         (15)                                              /*!< LPADC_T::ADCMPR0: CMPWEN Position      */
#define LPADC_ADCMPR0_CMPWEN_Msk         (0x1ul << LPADC_ADCMPR0_CMPWEN_Pos)               /*!< LPADC_T::ADCMPR0: CMPWEN Mask          */

#define LPADC_ADCMPR0_CMPD_Pos           (16)                                              /*!< LPADC_T::ADCMPR0: CMPD Position        */
#define LPADC_ADCMPR0_CMPD_Msk           (0xffful << LPADC_ADCMPR0_CMPD_Pos)               /*!< LPADC_T::ADCMPR0: CMPD Mask            */

#define LPADC_ADCMPR1_CMPEN_Pos          (0)                                               /*!< LPADC_T::ADCMPR1: CMPEN Position       */
#define LPADC_ADCMPR1_CMPEN_Msk          (0x1ul << LPADC_ADCMPR1_CMPEN_Pos)                /*!< LPADC_T::ADCMPR1: CMPEN Mask           */

#define LPADC_ADCMPR1_CMPIE_Pos          (1)                                               /*!< LPADC_T::ADCMPR1: CMPIE Position       */
#define LPADC_ADCMPR1_CMPIE_Msk          (0x1ul << LPADC_ADCMPR1_CMPIE_Pos)                /*!< LPADC_T::ADCMPR1: CMPIE Mask           */

#define LPADC_ADCMPR1_CMPCOND_Pos        (2)                                               /*!< LPADC_T::ADCMPR1: CMPCOND Position     */
#define LPADC_ADCMPR1_CMPCOND_Msk        (0x1ul << LPADC_ADCMPR1_CMPCOND_Pos)              /*!< LPADC_T::ADCMPR1: CMPCOND Mask         */

#define LPADC_ADCMPR1_CMPCH_Pos          (3)                                               /*!< LPADC_T::ADCMPR1: CMPCH Position       */
#define LPADC_ADCMPR1_CMPCH_Msk          (0x1ful << LPADC_ADCMPR1_CMPCH_Pos)               /*!< LPADC_T::ADCMPR1: CMPCH Mask           */

#define LPADC_ADCMPR1_CMPMCNT_Pos        (8)                                               /*!< LPADC_T::ADCMPR1: CMPMCNT Position     */
#define LPADC_ADCMPR1_CMPMCNT_Msk        (0xful << LPADC_ADCMPR1_CMPMCNT_Pos)              /*!< LPADC_T::ADCMPR1: CMPMCNT Mask         */

#define LPADC_ADCMPR1_CMPWEN_Pos         (15)                                              /*!< LPADC_T::ADCMPR1: CMPWEN Position      */
#define LPADC_ADCMPR1_CMPWEN_Msk         (0x1ul << LPADC_ADCMPR1_CMPWEN_Pos)               /*!< LPADC_T::ADCMPR1: CMPWEN Mask          */

#define LPADC_ADCMPR1_CMPD_Pos           (16)                                              /*!< LPADC_T::ADCMPR1: CMPD Position        */
#define LPADC_ADCMPR1_CMPD_Msk           (0xffful << LPADC_ADCMPR1_CMPD_Pos)               /*!< LPADC_T::ADCMPR1: CMPD Mask            */

#define LPADC_ADSR0_ADF_Pos              (0)                                               /*!< LPADC_T::ADSR0: ADF Position           */
#define LPADC_ADSR0_ADF_Msk              (0x1ul << LPADC_ADSR0_ADF_Pos)                    /*!< LPADC_T::ADSR0: ADF Mask               */

#define LPADC_ADSR0_CMPF0_Pos            (1)                                               /*!< LPADC_T::ADSR0: CMPF0 Position         */
#define LPADC_ADSR0_CMPF0_Msk            (0x1ul << LPADC_ADSR0_CMPF0_Pos)                  /*!< LPADC_T::ADSR0: CMPF0 Mask             */

#define LPADC_ADSR0_CMPF1_Pos            (2)                                               /*!< LPADC_T::ADSR0: CMPF1 Position         */
#define LPADC_ADSR0_CMPF1_Msk            (0x1ul << LPADC_ADSR0_CMPF1_Pos)                  /*!< LPADC_T::ADSR0: CMPF1 Mask             */

#define LPADC_ADSR0_BUSY_Pos             (7)                                               /*!< LPADC_T::ADSR0: BUSY Position          */
#define LPADC_ADSR0_BUSY_Msk             (0x1ul << LPADC_ADSR0_BUSY_Pos)                   /*!< LPADC_T::ADSR0: BUSY Mask              */

#define LPADC_ADSR0_VALIDF_Pos           (8)                                               /*!< LPADC_T::ADSR0: VALIDF Position        */
#define LPADC_ADSR0_VALIDF_Msk           (0x1ul << LPADC_ADSR0_VALIDF_Pos)                 /*!< LPADC_T::ADSR0: VALIDF Mask            */

#define LPADC_ADSR0_OVERRUNF_Pos         (16)                                              /*!< LPADC_T::ADSR0: OVERRUNF Position      */
#define LPADC_ADSR0_OVERRUNF_Msk         (0x1ul << LPADC_ADSR0_OVERRUNF_Pos)               /*!< LPADC_T::ADSR0: OVERRUNF Mask          */

#define LPADC_ADSR0_ADPRDY_Pos           (24)                                              /*!< LPADC_T::ADSR0: ADPRDY Position        */
#define LPADC_ADSR0_ADPRDY_Msk           (0x1ul << LPADC_ADSR0_ADPRDY_Pos)                 /*!< LPADC_T::ADSR0: ADPRDY Mask            */

#define LPADC_ADSR0_CHANNEL_Pos          (27)                                              /*!< LPADC_T::ADSR0: CHANNEL Position       */
#define LPADC_ADSR0_CHANNEL_Msk          (0x1ful << LPADC_ADSR0_CHANNEL_Pos)               /*!< LPADC_T::ADSR0: CHANNEL Mask           */

