zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpadc_reg.h
#define LPADC_ADSR1_VALID_Pos            (0)                                               /*!< LPADC_T::ADSR1: VALID Position         */
#define LPADC_ADSR1_VALID_Msk            (0xfffffffful << LPADC_ADSR1_VALID_Pos)           /*!< LPADC_T::ADSR1: VALID Mask             */

#define LPADC_ADSR2_OVERRUN_Pos          (0)                                               /*!< LPADC_T::ADSR2: OVERRUN Position       */
#define LPADC_ADSR2_OVERRUN_Msk          (0xfffffffful << LPADC_ADSR2_OVERRUN_Pos)         /*!< LPADC_T::ADSR2: OVERRUN Mask           */

#define LPADC_ESMPCTL_EXTSMPT_Pos        (0)                                               /*!< LPADC_T::ESMPCTL: EXTSMPT Position     */
#define LPADC_ESMPCTL_EXTSMPT_Msk        (0x3ffful << LPADC_ESMPCTL_EXTSMPT_Pos)           /*!< LPADC_T::ESMPCTL: EXTSMPT Mask         */

#define LPADC_CFDCTL_PRECHEN_Pos         (0)                                               /*!< LPADC_T::CFDCTL: PRECHEN Position      */
#define LPADC_CFDCTL_PRECHEN_Msk         (0x1ul << LPADC_CFDCTL_PRECHEN_Pos)               /*!< LPADC_T::CFDCTL: PRECHEN Mask          */

#define LPADC_CFDCTL_DISCHEN_Pos         (1)                                               /*!< LPADC_T::CFDCTL: DISCHEN Position      */
#define LPADC_CFDCTL_DISCHEN_Msk         (0x1ul << LPADC_CFDCTL_DISCHEN_Pos)               /*!< LPADC_T::CFDCTL: DISCHEN Mask          */

#define LPADC_CFDCTL_FDETCHEN_Pos        (8)                                               /*!< LPADC_T::CFDCTL: FDETCHEN Position     */
#define LPADC_CFDCTL_FDETCHEN_Msk        (0x1ul << LPADC_CFDCTL_FDETCHEN_Pos)              /*!< LPADC_T::CFDCTL: FDETCHEN Mask         */

#define LPADC_ADPDMA_CURDAT_Pos          (0)                                               /*!< LPADC_T::ADPDMA: CURDAT Position       */
#define LPADC_ADPDMA_CURDAT_Msk          (0x3fffful << LPADC_ADPDMA_CURDAT_Pos)            /*!< LPADC_T::ADPDMA: CURDAT Mask           */

#define LPADC_ADCAL_CALEN_Pos            (0)                                               /*!< LPADC_T::ADCAL: CALEN Position         */
#define LPADC_ADCAL_CALEN_Msk            (0x1ul << LPADC_ADCAL_CALEN_Pos)                  /*!< LPADC_T::ADCAL: CALEN Mask             */

#define LPADC_ADCAL_CALIE_Pos            (1)                                               /*!< LPADC_T::ADCAL: CALIE Position         */
#define LPADC_ADCAL_CALIE_Msk            (0x1ul << LPADC_ADCAL_CALIE_Pos)                  /*!< LPADC_T::ADCAL: CALIE Mask             */

#define LPADC_ADCALSTS_CALIF_Pos         (0)                                               /*!< LPADC_T::ADCALSTS: CALIF Position      */
#define LPADC_ADCALSTS_CALIF_Msk         (0x1ul << LPADC_ADCALSTS_CALIF_Pos)               /*!< LPADC_T::ADCALSTS: CALIF Mask          */

#define LPADC_AUTOCTL_TRIGSEL_Pos        (0)                                               /*!< LPADC_T::AUTOCTL: TRIGSEL Position     */
#define LPADC_AUTOCTL_TRIGSEL_Msk        (0xful << LPADC_AUTOCTL_TRIGSEL_Pos)              /*!< LPADC_T::AUTOCTL: TRIGSEL Mask         */

#define LPADC_AUTOCTL_TRIGEN_Pos         (4)                                               /*!< LPADC_T::AUTOCTL: TRIGEN Position      */
#define LPADC_AUTOCTL_TRIGEN_Msk         (0x1ul << LPADC_AUTOCTL_TRIGEN_Pos)               /*!< LPADC_T::AUTOCTL: TRIGEN Mask          */

#define LPADC_AUTOCTL_ADWKEN_Pos         (8)                                               /*!< LPADC_T::AUTOCTL: ADWKEN Position      */
#define LPADC_AUTOCTL_ADWKEN_Msk         (0x1ul << LPADC_AUTOCTL_ADWKEN_Pos)               /*!< LPADC_T::AUTOCTL: ADWKEN Mask          */

#define LPADC_AUTOCTL_CMP0WKEN_Pos       (9)                                               /*!< LPADC_T::AUTOCTL: CMP0WKEN Position    */
#define LPADC_AUTOCTL_CMP0WKEN_Msk       (0x1ul << LPADC_AUTOCTL_CMP0WKEN_Pos)             /*!< LPADC_T::AUTOCTL: CMP0WKEN Mask        */

#define LPADC_AUTOCTL_CMP1WKEN_Pos       (10)                                              /*!< LPADC_T::AUTOCTL: CMP1WKEN Position    */
#define LPADC_AUTOCTL_CMP1WKEN_Msk       (0x1ul << LPADC_AUTOCTL_CMP1WKEN_Pos)             /*!< LPADC_T::AUTOCTL: CMP1WKEN Mask        */

#define LPADC_AUTOCTL_AUTOEN_Pos         (31)                                              /*!< LPADC_T::AUTOCTL: AUTOEN Position      */
#define LPADC_AUTOCTL_AUTOEN_Msk         (0x1ul << LPADC_AUTOCTL_AUTOEN_Pos)               /*!< LPADC_T::AUTOCTL: AUTOEN Mask          */

#define LPADC_AUTOSTRG_SWTRIG_Pos        (0)                                               /*!< LPADC_T::AUTOSTRG: SWTRIG Position     */
#define LPADC_AUTOSTRG_SWTRIG_Msk        (0x1ul << LPADC_AUTOSTRG_SWTRIG_Pos)              /*!< LPADC_T::AUTOSTRG: SWTRIG Mask         */

#define LPADC_AUTOSTS_ADWKF_Pos          (0)                                               /*!< LPADC_T::AUTOSTS: ADWKF Position       */
#define LPADC_AUTOSTS_ADWKF_Msk          (0x1ul << LPADC_AUTOSTS_ADWKF_Pos)                /*!< LPADC_T::AUTOSTS: ADWKF Mask           */

#define LPADC_AUTOSTS_CMP0WKF_Pos        (1)                                               /*!< LPADC_T::AUTOSTS: CMP0WKF Position     */
#define LPADC_AUTOSTS_CMP0WKF_Msk        (0x1ul << LPADC_AUTOSTS_CMP0WKF_Pos)              /*!< LPADC_T::AUTOSTS: CMP0WKF Mask         */

#define LPADC_AUTOSTS_CMP1WKF_Pos        (2)                                               /*!< LPADC_T::AUTOSTS: CMP1WKF Position     */
#define LPADC_AUTOSTS_CMP1WKF_Msk        (0x1ul << LPADC_AUTOSTS_CMP1WKF_Pos)              /*!< LPADC_T::AUTOSTS: CMP1WKF Mask         */


/** @} LPADC_CONST */
/** @} end of LPADC register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __LPADC_REG_H__ */
